app/Http/Controllers/Auth/ResetPasswordController.php

    public function requestPassword(Request $request)
    {
        $email = $request->only('email');
        $member = Member::where('email', $email)->first();
---
select * from `members` where `email` = 'member1@gmail.com' and `members`.`deleted_at` is null limit 1