app/Services/CartService.php

    public function addToCart($request, $params){
        if(isset($params['product_id'])){
            $product = Product::where('id', $params['product_id'])->first();
            $color = Color::where('id', $params['color_id'])->first();
            $size = Size::where('id', $params['color_id'])->first();
            $data['id'] = $params['product_id'];
            $data['color'] = $color->name;
            $data['size'] = $size->name;
            $data['quantity'] = $params['quantity'];

            if (Auth::check()){
                if (Session::get('Cart') != null){
                    foreach (Session::get('Cart')->products as $product_id => $item){
                        $cart = MainCart::create([
                            'product_id' => $product_id,
                            'member_id' => Auth::id(),
                            'color' => $item['color'],
                            'size' =>$item['size'],
                            'quantity' => $item['quantity']
                        ]);
                    }
                    $request->Session()->forget('Cart');
                }
                else
                {
                    $flagCheck = $this->checkDuplicate($data);
                    if($flagCheck){
                        $product = MainCart::where('product_id', $data['id'])
                                            ->where('member_id', Auth::id())
                                            ->where('color', $data['color'])
                                            ->where('size', $data['size'])->first();
---
select * from `products` where `id` = '14' and `products`.`deleted_at` is null limit 1
select * from `colors` where `id` = '1' limit 1
select * from `sizes` where `id` = '1' limit 1
insert into `carts` (`product_id`, `member_id`, `color`, `size`, `quantity`, `updated_at`, `created_at`) values (15, 2, 'Red', 'S', 3, '2022-07-22 04:05:08', '2022-07-22 04:05:08')
select * from `carts` where `product_id` = '14' and `member_id` = 1 and `color` = 'Purple' and `size` = 'XS' limit 1

    public function deleteListCart($request, $id){
        if(Auth::check()){
            MainCart::where('product_id', $id)->delete();
---
delete from `carts` where `product_id` = '11'

    public function getCart($id){
        return MainCart::where('member_id', $id)->get();
---
select * from `carts` where `member_id` is null

    public function insertCart($data){
        MainCart::create([
            'product_id' => $data['id'],
            'member_id' => Auth::id(),
            'color' => $data['color'],
            'size' =>$data['size'],
            'quantity' => $data['quantity']
        ]);
---
insert into `carts` (`product_id`, `member_id`, `color`, `size`, `quantity`, `updated_at`, `created_at`) values ('14', 1, 'Purple', 'XS', '5', '2022-07-22 03:48:01', '2022-07-22 03:48:01')

    public function checkDuplicate($data){
        $carts = MainCart::get();
---
select * from `carts`