app/Services/CartService.php

select * from `members` where `email` = 'member3@gmail.com' and `members`.`deleted_at` is null limit 1
---
    public function insertCartIfAuthentication($request){
        if (Session::get('Cart') != null){
            $email = $request->only('email');
            $member = Member::where('email', $email)->first();

select * from `carts` where `member_id` = 3
---
    public function getCart($id){
        return MainCart::where('member_id', $id)->get();