app/Services/CartService.php

update `carts` set `quantity` = 10, `carts`.`updated_at` = '2022-07-22 03:37:56' where `id` = 43
---
    public function saveQtyItemCart($request, $id, $quanity){
        if(auth('web')->user()){
            MainCart::where('product_id', $id)->update(['quantity'=> $quanity]);