app/Services/CategoryService.php

select * from `categories` order by `created_at` desc
---
    public function getListCategory(){
        return Category::latest()->get();