app/Services/ColorService.php

    public function getListColor(){
        return Color::latest()->get();
---
select * from `colors` order by `created_at` desc