app/Services/ProductService.php

select * from `products` where `slug` = 'flowy-shirt' and `products`.`deleted_at` is null limit 1
---
    public function getProductBySlug($slug){
        return Product::where('slug', $slug)->first();

select * from `products` where `id` = '14' and `products`.`deleted_at` is null limit 1
---
    public function getProductById($id){
        return Product::where('id', $id)->first();

select * from `products` where `category_id` = '1' and `products`.`deleted_at` is null order by `id` desc limit 6 offset 0
select count(*) as aggregate from `products` where `category_id` = '1' and `products`.`deleted_at` is null
---
    public function filterProducts($params)
    {
        $recorder = $params['recorder'] ?? 10;
        $query = Product::query();

        if(isset($params['category_id'])){
            $query->where('category_id', $params['category_id']);
        }

        if(isset($params['orderBy'])){
            $query->orderBy($params['orderBy']['colum'], $params['orderBy']['dir']);
        }

        if(isset($params['search'])){
            $query->where('name', 'LIKE', '%'.$params['search'].'%');
        }

        return $query->paginate($recorder);