app/Services/SizeService.php

    public function getListSize(){
        return Size::latest()->get();
---
select * from `sizes` order by `created_at` desc