app/Http/Controllers/Admin/Auth/ResetPasswordController.php

select * from `admins` where `email` = 'admin1@gmail.com' limit 1
---
    public function requestPassword(Request $request)
    {
        $email = $request->only('email');
        $admin = Admin::where('email', $email)->first();